[ReaperMonk X2SoldierClassTemplate]
+DisplayName="Reaper Monk"
+ClassSummary="A Reaper who has trained extensively in the martial arts, and whose subterfuge is of a much more offensive sort ."
+LeftAbilityTreeTitle="Open Palm"
+RightAbilityTreeTitle="Shadow Hand"
AbilityTreeTitles[0]="Open Palm"
AbilityTreeTitles[1]="Shadow Hand"
AbilityTreeTitles[2]="Closed Fist"
AbilityTreeTitles[3]="Umbral Disciple"


[KVMonkFlurry X2AbilityTemplate]
LocFriendlyName="Flurry of Blows"
LocLongDescription="Unleash a combo of unarmed attacks then make your escape. Grants one action point after your first attack and one move AP after your second."
LocHelpText="Unleash a combo of unarmed attacks then make your escape. Grants one action point after your first attack and one move AP after your second."
LocPromotionPopupText="<Bullet/> If you move before attacking the first time, you will not gain the standard AP unless you have a bonus move action.<br/><Bullet/> Requires unarmed weapons.<br/><Bullet/> Grants a small amount of mobility after attacking."
LocFlyOverText="Flurry of Blows"

[KVStealth X2AbilityTemplate]
LocFriendlyName="Enter the Shadows"
LocLongDescription="Enter concealement as a free action and passively gain reduced detection radius."
LocHelpText="Enter concealement as a free action and passively gain reduced detection radius."
LocPromotionPopupText="<Bullet/>Requires you to not be flanked when used.<br/><Bullet/> Has one charge by default.<br/><Bullet/> Detection radius is reduced by 50%."
LocFlyOverText="Enter the Shadows"

[KVMartialArts X2AbilityTemplate]
LocFriendlyName="Martial Arts"
LocLongDescription="Grants +1 damage, +7 aim, and +10 crit with melee weapons."
LocHelpText="Grants +1 damage, +7 aim, and +10 crit with melee weapons."
LocPromotionPopupText=""
LocFlyOverText="Martial Arts"

[KVFlyingKickAbility X2AbilityTemplate]
LocFriendlyName="Flying Kick"
LocLongDescription="Grants +2 mobility for each attack made, lasts 2 rounds."
LocHelpText="Grants +2 mobility for each attack made, lasts 2 rounds."
LocPromotionPopupText="<Bullet/> Although the bonus is small, the Monk can make quite a few attacks in a round, leading to potentially huge mobility bonuses as it stacks up."
LocFlyOverText="Flying Kick"

[KVUpgradeStealth X2AbilityTemplate]
LocFriendlyName="Shadow Cloak"
LocLongDescription="Grants 2 additional charges of Enter the Shadows and reduces detection radius further."
LocHelpText="Grants 2 additional charges of Enter the Shadows and reduces detection radius further."
LocPromotionPopupText="<Bullet/> Total detection radius is reduced by 80% with this perk."
LocFlyOverText="Shadow Cloak"

[KVGarrote X2AbilityTemplate]
LocFriendlyName="Garrote"
LocLongDescription="Increases melee damage by 2 while concealed and lowers the cooldown of Silent Takedown by 1."
LocHelpText="Increases melee damage by 2 while concealed and lowers the cooldown of Silent Takedown by 1."
LocPromotionPopupText=""
LocFlyOverText="Garrote"

[KVMonkHeal X2AbilityTemplate]
LocFriendlyName="Wholeness of Body"
LocLongDescription="Heal yourself for a large amount and removing damaging conditions."
LocHelpText="Heal yourself for a large amount and removing damaging conditions."
LocPromotionPopupText="<Bullet/> Heals for 8 HP.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turns cooldown."
LocFlyOverText="Wholeness of Body"

[KVWallPhasing X2AbilityTemplate]
LocFriendlyName="Empty Body"
LocLongDescription="Become ethereal, allowing you to pass through walls and other objects."
LocHelpText="Become ethereal, allowing you to pass through walls and other objects."
LocPromotionPopupText="<Bullet/> Lasts 2 turns.<br/><Bullet/> <br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turns cooldown."
LocFlyOverText="Empty Body"

[KVReStealthPassive X2AbilityTemplate]
LocFriendlyName="Become the Shadow"
LocLongDescription="Automatically gain concealment at the end of every turn."
LocHelpText="Automatically gain concealment at the end of every turn."
LocPromotionPopupText="<Bullet/>This applies even if you are flanked, but you might be revealed very easily on the enemies' turn."
LocFlyOverText="Become the Shadow"

[KVReStealth X2AbilityTemplate]
LocFriendlyName="Become the Shadow"
LocLongDescription="Automatically gain concealment at the end of every turn."
LocHelpText="Automatically gain concealment at the end of every turn."
LocPromotionPopupText="<Bullet/>This applies even if you are flanked, but you might be revealed very easily on the enemies' turn."
LocFlyOverText="Become the Shadow"

[KVStunningFist X2AbilityTemplate]
LocFriendlyName="Stunning Fist"
LocLongDescription="Strike a target and stun them for 3 actions."
LocHelpText="Strike a target and stun them for 3 actions."
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turns cooldown."
LocFlyOverText="Stunning Fist"

[KVEvasion X2AbilityTemplate]
LocFriendlyName="Evasion"
LocLongDescription="Prepare to evade incoming attacks, gaining 10 defense and 50 dodge until your next turn."
LocHelpText="Prepare to evade incoming attacks, gaining 10 defense and 50 dodge until your next turn."
LocPromotionPopupText="<Bullet/> Can only be used with move only actions.<br/><Bullet/> Has no cooldown, but does not stack with itself."
LocFlyOverText="Evasion"

[KVFlyingKickBuff X2AbilityTemplate]
LocFriendlyName="Flying Kick"
LocLongDescription="Mobility increased."
LocHelpText="Mobility increased."
LocPromotionPopupText=""
LocFlyOverText="Flying Kick"

[KVTumble X2AbilityTemplate]
LocFriendlyName="Tumble"
LocLongDescription="Gain two move action points at the cost of one standard action point and avoid some reaction fire."
LocHelpText="Gain two move action points at the cost of one standard action point and avoid some reaction fire."
LocPromotionPopupText="<Bullet/> Costs 1 action, but grants two move AP after, which can be used on moving or other abilities as normal.<br/><Bullet/> Adds a small mobility penalty for the rest of the turn. <br/><Bullet/> Provides Lightning Reflexes while active. <br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turns cooldown."
LocFlyOverText="Tumble"

[KVTimelessBody X2AbilityTemplate]
LocFriendlyName="Timeless Body"
LocLongDescription="Grants a bonus to Will and immunity to stun, disorientation, and poison."
LocHelpText="Grants a bonus to Will and immunity to stun, disorientation, and poison."
LocPromotionPopupText="<Bullet/> <br/><Bullet/> "
LocFlyOverText="Timeless Body"

[KVSpinKick X2AbilityTemplate]
LocFriendlyName="Spin Kick"
LocLongDescription="Perform a roundhouse kick, damaging targets in a cone in front of you at a bonus to damage."
LocHelpText=""Perform a roundhouse kick, damaging targets in a cone in front of you at a bonus to damage."
LocPromotionPopupText="<Bullet/> Damage is increased by 50%, giving the Monk a way to deal with armour. <br/><Bullet/> Does not have a move component, so position accordingly beforehand."
LocFlyOverText="Spin Kick"

[KVSpinKickPassive X2AbilityTemplate]
LocFriendlyName="Spin Kick"
LocLongDescription="Perform a roundhouse kick, damaging targets in a cone in front of you at a bonus to damage."
LocHelpText=""Perform a roundhouse kick, damaging targets in a cone in front of you at a bonus to damage."
LocPromotionPopupText="<Bullet/> Damage is increased by 50%, giving the Monk a way to deal with armour. <br/><Bullet/> Does not have a move component, so position accordingly beforehand."
LocFlyOverText="Spin Kick"

[KVImpEvasionPassive X2AbilityTemplate]
LocFriendlyName="Improved Evasion"
LocLongDescription="When you use Evasion, gain a bonus move action."
LocHelpText="When you use Evasion, gain a bonus move action."
LocPromotionPopupText="<Bullet/> This effectively allows you to use Evasion every turn with no downside, if you were going to move anyway."
LocFlyOverText="Improved Evasion"

[ X2AbilityTemplate]
LocFriendlyName=""
LocLongDescription=""
LocHelpText=""
LocPromotionPopupText="<Bullet/> <br/><Bullet/> "
LocFlyOverText=""